import StyledProfile from '@styles/pages/profile/Profile-styled';

const Profile = () => {
  return (
    <StyledProfile>
      <div className='wrapper'>
        {/* 뒤로가기 기호와 프로필이라는 글자가 있는 헤더 */}
        <div className='header'>
          {/* 뒤로가기 SVG 이미지 */}
          <svg
            className='header__back'
            xmlns='http://www.w3.org/2000/svg'
            width='55'
            height='55'
            viewBox='0 0 55 55'
            fill='none'
          >
            <path
              d='M12.0312 25.7812H46.4062C46.8621 25.7812 47.2993 25.9623 47.6216 26.2847C47.9439 26.607 48.125 27.0442 48.125 27.5C48.125 27.9558 47.9439 28.393 47.6216 28.7153C47.2993 29.0377 46.8621 29.2188 46.4062 29.2188H12.0312C11.5754 29.2188 11.1382 29.0377 10.8159 28.7153C10.4936 28.393 10.3125 27.9558 10.3125 27.5C10.3125 27.0442 10.4936 26.607 10.8159 26.2847C11.1382 25.9623 11.5754 25.7812 12.0312 25.7812Z'
              fill='black'
            />
            <path
              d='M12.743 27.5L26.9983 41.7518C27.321 42.0746 27.5023 42.5123 27.5023 42.9687C27.5023 43.4251 27.321 43.8629 26.9983 44.1856C26.6755 44.5083 26.2378 44.6896 25.7814 44.6896C25.325 44.6896 24.8873 44.5083 24.5645 44.1856L9.09577 28.7168C8.93571 28.5572 8.80872 28.3675 8.72207 28.1587C8.63542 27.9499 8.59082 27.726 8.59082 27.5C8.59082 27.2739 8.63542 27.05 8.72207 26.8412C8.80872 26.6324 8.93571 26.4428 9.09577 26.2831L24.5645 10.8143C24.8873 10.4916 25.325 10.3103 25.7814 10.3103C26.2378 10.3103 26.6755 10.4916 26.9983 10.8143C27.321 11.1371 27.5023 11.5748 27.5023 12.0312C27.5023 12.4876 27.321 12.9254 26.9983 13.2481L12.743 27.5Z'
              fill='black'
            />
          </svg>
          {/* 프로필 글자 */}
          <span className='header__title'>프로필</span>
        </div>
        {/* 프로필 사진과 이름, 소개글이 있는 섹션 */}
        <div className='profile'>
          {/* 배경 사진 */}
          <div className='profile__background'>
            <img></img>
          </div>
          {/* 프로필 사진 */}
          <div className='profile__image'>
            <img></img>
          </div>
          {/* 프로필 정보: 이름과 소개글 */}
          {/* <div className='profile__info'> */}
          {/* 프로필 편집 버튼 */}
          <button type='button' className='profile__edit'>
            프로필 편집
          </button>
          {/* 사용자 이름 */}
          <span className='profile__name'>사용자의 이름</span>
          {/* 사용자 소개글 */}
          <span className='profile__bio'>사용자의 소개글</span>
          {/* </div> */}
        </div>
        {/* 사용자가 쓴 글들이 보이는 섹션 */}
        <div className='posts'>
          {/* 사용자가 쓴 글을 보여주는, 공통된 컴포넌트를 불러와서 여기 쓰면 될 듯 함.  */}
        </div>
      </div>
    </StyledProfile>
  );
};

export default Profile;
